opends/tests/functional-tests/shared/data/dsml/suites/09modDNsuite/data/moddn998.dat

POST /dsml HTTP/1.1
Host: Foo
Connection: Close
Content-Length: 1082
SOAPAction: "#batchRequest"

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
  <soap-env:Body>
  <batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core">
     <searchRequest requestID="229" dn="o=dsmlfe.com" scope="wholeSubtree" derefAliases="neverDerefAliases">
     	<filter>
		<equalityMatch name="uid">
			<value>thisisaminoradjustment</value>
		</equalityMatch>
	</filter>
     </searchRequest>
     <searchRequest requestID="230" dn="o=dsmlfe.com" scope="wholeSubtree" derefAliases="neverDerefAliases">
     	<filter>
		<equalityMatch name="uid">
			<value>jhunter</value>
		</equalityMatch>
	</filter>
     </searchRequest>
     <searchRequest requestID="232" dn="o=dsmlfe.com" scope="wholeSubtree" derefAliases="neverDerefAliases">
     	<filter>
		<equalityMatch name="uid">
			<value>ashelton</value>
		</equalityMatch>
	</filter>
     </searchRequest>
  </batchRequest>
  </soap-env:Body>
  </soap-env:Envelope>
